---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.WaterLoopType
source: html/63d06b2b-3db5-20e0-449a-e28d04a665c4.htm
---
# Autodesk.Revit.DB.Mechanical.WaterLoopType

The type of water loop.

## Syntax (C#)
```csharp
public enum WaterLoopType
```